Revit 2027 API
ParameterTypeId.StairsTrisertypeNosingPlacement Property
 "Apply Nosing Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsTrisertypeNosingPlacement { get; }
Public Shared ReadOnly Property StairsTrisertypeNosingPlacement As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsTrisertypeNosingPlacement {
	ForgeTypeId^ get ();
}
static member StairsTrisertypeNosingPlacement : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace